"1 210 1 4206624770 ,"
"input.1 1 3 320 320 ,"
" 1002 1005 1008 1011 1014 1017 1020 1023 1026 1029 1032 1035 1038 424 425 430 433 438 439 444 445 446 449 454 455 460 461 462 465 470 471 476 477 478 481 486 487 492 497 500 505 506 511 512 513 516 521 522 527 528 529 532 537 538 543 544 545 548 553 554 559 560 561 564 569 570 575 576 577 580 585 586 591 592 593 596 601 602 607 608 609 612 617 618 623 628 631 636 637 642 643 644 647 652 653 658 659 660 663 668 669 674 675 676 679 684 685 690 691 692 693 712 713 732 733 752 753 772 773 776 779 782 785 786 787 788 789 791 792 794 795 798 801 804 807 808 809 810 811 813 814 816 817 820 823 826 829 830 831 832 833 835 836 838 839 840 843 846 849 852 855 858 861 864 867 870 873 876 879 882 885 888 891 894 897 900 903 906 909 912 915 918 921 924 927 930 933 936 939 942 945 948 951 954 957 960 963 966 969 972 975 978 981 984 987 990 993 996 999 input.1 ,"
"792 814 836 795 817 839 ,"
" 193 ,"
"Convolution Conv_0 1 1 input.1 840 1 3 24 3 3 2 2 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_1 1 1 840 424 1 0 ,"
"Pooling MaxPool_2 1 1 424 425 0 3 3 2 2 1 1 -1 -1 -1 0 ,"
"Convolution Conv_3 1 1 425 843 24 1 24 3 3 2 2 1 1 1 -1 1 1 ,"
"Convolution Conv_4 1 1 843 846 1 24 58 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_5 1 1 846 430 1 0 ,"
"Convolution Conv_6 1 1 425 849 1 24 58 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_7 1 1 849 433 1 0 ,"
"Convolution Conv_8 1 1 433 852 58 1 58 3 3 2 2 1 1 1 -1 1 1 ,"
"Convolution Conv_9 1 1 852 855 1 58 58 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_10 1 1 855 438 1 0 ,"
"Concat Concat_11 2 1 430 438 439 1 ,"
"ShuffleChannel Reshape_16 1 1 439 444 2 ,"
"SplitV Split_17 1 2 444 445 446 1 2 58 58 ,"
"Convolution Conv_18 1 1 446 858 1 58 58 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_19 1 1 858 449 1 0 ,"
"Convolution Conv_20 1 1 449 861 58 1 58 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_21 1 1 861 864 1 58 58 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_22 1 1 864 454 1 0 ,"
"Concat Concat_23 2 1 445 454 455 1 ,"
"ShuffleChannel Reshape_28 1 1 455 460 2 ,"
"SplitV Split_29 1 2 460 461 462 1 2 58 58 ,"
"Convolution Conv_30 1 1 462 867 1 58 58 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_31 1 1 867 465 1 0 ,"
"Convolution Conv_32 1 1 465 870 58 1 58 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_33 1 1 870 873 1 58 58 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_34 1 1 873 470 1 0 ,"
"Concat Concat_35 2 1 461 470 471 1 ,"
"ShuffleChannel Reshape_40 1 1 471 476 2 ,"
"SplitV Split_41 1 2 476 477 478 1 2 58 58 ,"
"Convolution Conv_42 1 1 478 876 1 58 58 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_43 1 1 876 481 1 0 ,"
"Convolution Conv_44 1 1 481 879 58 1 58 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_45 1 1 879 882 1 58 58 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_46 1 1 882 486 1 0 ,"
"Concat Concat_47 2 1 477 486 487 1 ,"
"ShuffleChannel Reshape_52 1 1 487 492 2 ,"
"Convolution Conv_53 1 1 492 885 116 1 116 3 3 2 2 1 1 1 -1 1 1 ,"
"Convolution Conv_54 1 1 885 888 1 116 116 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_55 1 1 888 497 1 0 ,"
"Convolution Conv_56 1 1 492 891 1 116 116 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_57 1 1 891 500 1 0 ,"
"Convolution Conv_58 1 1 500 894 116 1 116 3 3 2 2 1 1 1 -1 1 1 ,"
"Convolution Conv_59 1 1 894 897 1 116 116 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_60 1 1 897 505 1 0 ,"
"Concat Concat_61 2 1 497 505 506 1 ,"
"ShuffleChannel Reshape_66 1 1 506 511 2 ,"
"SplitV Split_67 1 2 511 512 513 1 2 116 116 ,"
"Convolution Conv_68 1 1 513 900 1 116 116 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_69 1 1 900 516 1 0 ,"
"Convolution Conv_70 1 1 516 903 116 1 116 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_71 1 1 903 906 1 116 116 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_72 1 1 906 521 1 0 ,"
"Concat Concat_73 2 1 512 521 522 1 ,"
"ShuffleChannel Reshape_78 1 1 522 527 2 ,"
"SplitV Split_79 1 2 527 528 529 1 2 116 116 ,"
"Convolution Conv_80 1 1 529 909 1 116 116 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_81 1 1 909 532 1 0 ,"
"Convolution Conv_82 1 1 532 912 116 1 116 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_83 1 1 912 915 1 116 116 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_84 1 1 915 537 1 0 ,"
"Concat Concat_85 2 1 528 537 538 1 ,"
"ShuffleChannel Reshape_90 1 1 538 543 2 ,"
"SplitV Split_91 1 2 543 544 545 1 2 116 116 ,"
"Convolution Conv_92 1 1 545 918 1 116 116 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_93 1 1 918 548 1 0 ,"
"Convolution Conv_94 1 1 548 921 116 1 116 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_95 1 1 921 924 1 116 116 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_96 1 1 924 553 1 0 ,"
"Concat Concat_97 2 1 544 553 554 1 ,"
"ShuffleChannel Reshape_102 1 1 554 559 2 ,"
"SplitV Split_103 1 2 559 560 561 1 2 116 116 ,"
"Convolution Conv_104 1 1 561 927 1 116 116 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_105 1 1 927 564 1 0 ,"
"Convolution Conv_106 1 1 564 930 116 1 116 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_107 1 1 930 933 1 116 116 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_108 1 1 933 569 1 0 ,"
"Concat Concat_109 2 1 560 569 570 1 ,"
"ShuffleChannel Reshape_114 1 1 570 575 2 ,"
"SplitV Split_115 1 2 575 576 577 1 2 116 116 ,"
"Convolution Conv_116 1 1 577 936 1 116 116 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_117 1 1 936 580 1 0 ,"
"Convolution Conv_118 1 1 580 939 116 1 116 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_119 1 1 939 942 1 116 116 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_120 1 1 942 585 1 0 ,"
"Concat Concat_121 2 1 576 585 586 1 ,"
"ShuffleChannel Reshape_126 1 1 586 591 2 ,"
"SplitV Split_127 1 2 591 592 593 1 2 116 116 ,"
"Convolution Conv_128 1 1 593 945 1 116 116 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_129 1 1 945 596 1 0 ,"
"Convolution Conv_130 1 1 596 948 116 1 116 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_131 1 1 948 951 1 116 116 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_132 1 1 951 601 1 0 ,"
"Concat Concat_133 2 1 592 601 602 1 ,"
"ShuffleChannel Reshape_138 1 1 602 607 2 ,"
"SplitV Split_139 1 2 607 608 609 1 2 116 116 ,"
"Convolution Conv_140 1 1 609 954 1 116 116 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_141 1 1 954 612 1 0 ,"
"Convolution Conv_142 1 1 612 957 116 1 116 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_143 1 1 957 960 1 116 116 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_144 1 1 960 617 1 0 ,"
"Concat Concat_145 2 1 608 617 618 1 ,"
"ShuffleChannel Reshape_150 1 1 618 623 2 ,"
"Convolution Conv_151 1 1 623 963 232 1 232 3 3 2 2 1 1 1 -1 1 1 ,"
"Convolution Conv_152 1 1 963 966 1 232 232 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_153 1 1 966 628 1 0 ,"
"Convolution Conv_154 1 1 623 969 1 232 232 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_155 1 1 969 631 1 0 ,"
"Convolution Conv_156 1 1 631 972 232 1 232 3 3 2 2 1 1 1 -1 1 1 ,"
"Convolution Conv_157 1 1 972 975 1 232 232 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_158 1 1 975 636 1 0 ,"
"Concat Concat_159 2 1 628 636 637 1 ,"
"ShuffleChannel Reshape_164 1 1 637 642 2 ,"
"SplitV Split_165 1 2 642 643 644 1 2 232 232 ,"
"Convolution Conv_166 1 1 644 978 1 232 232 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_167 1 1 978 647 1 0 ,"
"Convolution Conv_168 1 1 647 981 232 1 232 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_169 1 1 981 984 1 232 232 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_170 1 1 984 652 1 0 ,"
"Concat Concat_171 2 1 643 652 653 1 ,"
"ShuffleChannel Reshape_176 1 1 653 658 2 ,"
"SplitV Split_177 1 2 658 659 660 1 2 232 232 ,"
"Convolution Conv_178 1 1 660 987 1 232 232 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_179 1 1 987 663 1 0 ,"
"Convolution Conv_180 1 1 663 990 232 1 232 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_181 1 1 990 993 1 232 232 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_182 1 1 993 668 1 0 ,"
"Concat Concat_183 2 1 659 668 669 1 ,"
"ShuffleChannel Reshape_188 1 1 669 674 2 ,"
"SplitV Split_189 1 2 674 675 676 1 2 232 232 ,"
"Convolution Conv_190 1 1 676 996 1 232 232 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_191 1 1 996 679 1 0 ,"
"Convolution Conv_192 1 1 679 999 232 1 232 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_193 1 1 999 1002 1 232 232 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_194 1 1 1002 684 1 0 ,"
"Concat Concat_195 2 1 675 684 685 1 ,"
"ShuffleChannel Reshape_200 1 1 685 690 2 ,"
"Convolution Conv_201 1 1 492 691 1 116 96 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_202 1 1 623 692 1 232 96 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_203 1 1 690 693 1 464 96 1 1 1 1 0 0 1 -1 1 1 ,"
"Upsample Resize_222 1 1 693 712 2 0 0 0 20 20 ,"
"Add Add_223 2 1 692 712 713 ,"
"Upsample Resize_242 1 1 713 732 2 0 0 0 40 40 ,"
"Add Add_243 2 1 691 732 733 ,"
"Upsample Resize_262 1 1 733 752 2 0 0 0 20 20 ,"
"Add Add_263 2 1 713 752 753 ,"
"Upsample Resize_282 1 1 753 772 2 0 0 0 10 10 ,"
"Add Add_283 2 1 693 772 773 ,"
"Convolution Conv_284 1 1 733 1005 96 1 96 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_285 1 1 1005 776 1 0 ,"
"Convolution Conv_286 1 1 776 1008 1 96 96 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_287 1 1 1008 779 1 0 ,"
"Convolution Conv_288 1 1 779 1011 96 1 96 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_289 1 1 1011 782 1 0 ,"
"Convolution Conv_290 1 1 782 1014 1 96 96 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_291 1 1 1014 785 1 0 ,"
"Convolution Conv_292 1 1 785 786 1 96 112 1 1 1 1 0 0 1 -1 1 1 ,"
"SplitV Split_293 1 2 786 787 788 1 2 80 32 ,"
"Sigmoid Sigmoid_294 1 1 787 789 ,"
"Reshape Reshape_296 1 1 789 791 0 4 4 0 80 -1 1 ,"
"Permute Transpose_297 1 1 791 792 3 0 2 1 ,"
"Reshape Reshape_299 1 1 788 794 0 4 4 0 32 -1 1 ,"
"Permute Transpose_300 1 1 794 795 3 0 2 1 ,"
"Convolution Conv_301 1 1 753 1017 96 1 96 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_302 1 1 1017 798 1 0 ,"
"Convolution Conv_303 1 1 798 1020 1 96 96 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_304 1 1 1020 801 1 0 ,"
"Convolution Conv_305 1 1 801 1023 96 1 96 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_306 1 1 1023 804 1 0 ,"
"Convolution Conv_307 1 1 804 1026 1 96 96 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_308 1 1 1026 807 1 0 ,"
"Convolution Conv_309 1 1 807 808 1 96 112 1 1 1 1 0 0 1 -1 1 1 ,"
"SplitV Split_310 1 2 808 809 810 1 2 80 32 ,"
"Sigmoid Sigmoid_311 1 1 809 811 ,"
"Reshape Reshape_313 1 1 811 813 0 4 4 0 80 -1 1 ,"
"Permute Transpose_314 1 1 813 814 3 0 2 1 ,"
"Reshape Reshape_316 1 1 810 816 0 4 4 0 32 -1 1 ,"
"Permute Transpose_317 1 1 816 817 3 0 2 1 ,"
"Convolution Conv_318 1 1 773 1029 96 1 96 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_319 1 1 1029 820 1 0 ,"
"Convolution Conv_320 1 1 820 1032 1 96 96 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_321 1 1 1032 823 1 0 ,"
"Convolution Conv_322 1 1 823 1035 96 1 96 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_323 1 1 1035 826 1 0 ,"
"Convolution Conv_324 1 1 826 1038 1 96 96 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_325 1 1 1038 829 1 0 ,"
"Convolution Conv_326 1 1 829 830 1 96 112 1 1 1 1 0 0 1 -1 1 1 ,"
"SplitV Split_327 1 2 830 831 832 1 2 80 32 ,"
"Sigmoid Sigmoid_328 1 1 831 833 ,"
"Reshape Reshape_330 1 1 833 835 0 4 4 0 80 -1 1 ,"
"Permute Transpose_331 1 1 835 836 3 0 2 1 ,"
"Reshape Reshape_333 1 1 832 838 0 4 4 0 32 -1 1 ,"
"Permute Transpose_334 1 1 838 839 3 0 2 1 ,"
