"1 181 1 4206624770 ,"
"images 1 3 448 640 ,"
" 171 176 181 186 191 196 201 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 328 329 330 331 332 333 334 335 336 337 338 339 340 341 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377 387 394 405 412 413 423 430 431 images output ,"
"output 413 431 ,"
" 180 ,"
"StridedSlice Slice_4 1 1 images 171 4 0 0 0 0 4 0 0 0 0 4 1 1 2 1 ,"
"StridedSlice Slice_9 1 1 171 176 4 0 0 0 0 4 0 0 0 0 4 1 1 1 2 ,"
"StridedSlice Slice_14 1 1 images 181 4 0 0 1 0 4 0 0 0 0 4 1 1 2 1 ,"
"StridedSlice Slice_19 1 1 181 186 4 0 0 0 0 4 0 0 0 0 4 1 1 1 2 ,"
"StridedSlice Slice_24 1 1 images 191 4 0 0 0 0 4 0 0 0 0 4 1 1 2 1 ,"
"StridedSlice Slice_29 1 1 191 196 4 0 0 0 1 4 0 0 0 0 4 1 1 1 2 ,"
"StridedSlice Slice_34 1 1 images 201 4 0 0 1 0 4 0 0 0 0 4 1 1 2 1 ,"
"StridedSlice Slice_39 1 1 201 206 4 0 0 0 1 4 0 0 0 0 4 1 1 1 2 ,"
"Concat Concat_40 4 1 176 186 196 206 207 1 ,"
"Convolution Conv_41 1 1 207 208 1 12 32 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_42 1 1 208 209 1 0 ,"
"Convolution Conv_43 1 1 209 210 1 32 64 3 3 2 2 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_44 1 1 210 211 1 0 ,"
"Convolution Conv_45 1 1 211 212 1 64 32 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_46 1 1 212 213 1 0 ,"
"Convolution Conv_47 1 1 213 214 1 32 32 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_48 1 1 214 215 1 0 ,"
"Convolution Conv_49 1 1 215 216 1 32 32 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_50 1 1 216 217 1 0 ,"
"Add Add_51 2 1 213 217 218 ,"
"Convolution Conv_52 1 1 218 219 1 32 32 1 1 1 1 0 0 0 -1 1 1 ,"
"Convolution Conv_53 1 1 211 220 1 64 32 1 1 1 1 0 0 0 -1 1 1 ,"
"Concat Concat_54 2 1 219 220 221 1 ,"
"BatchNormCxx BatchNormalization_55 1 1 221 222 ,"
"PReLU LeakyRelu_56 1 1 222 223 1 0 ,"
"Convolution Conv_57 1 1 223 224 1 64 64 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_58 1 1 224 225 1 0 ,"
"Convolution Conv_59 1 1 225 226 1 64 128 3 3 2 2 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_60 1 1 226 227 1 0 ,"
"Convolution Conv_61 1 1 227 228 1 128 64 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_62 1 1 228 229 1 0 ,"
"Convolution Conv_63 1 1 229 230 1 64 64 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_64 1 1 230 231 1 0 ,"
"Convolution Conv_65 1 1 231 232 1 64 64 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_66 1 1 232 233 1 0 ,"
"Add Add_67 2 1 229 233 234 ,"
"Convolution Conv_68 1 1 234 235 1 64 64 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_69 1 1 235 236 1 0 ,"
"Convolution Conv_70 1 1 236 237 1 64 64 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_71 1 1 237 238 1 0 ,"
"Add Add_72 2 1 234 238 239 ,"
"Convolution Conv_73 1 1 239 240 1 64 64 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_74 1 1 240 241 1 0 ,"
"Convolution Conv_75 1 1 241 242 1 64 64 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_76 1 1 242 243 1 0 ,"
"Add Add_77 2 1 239 243 244 ,"
"Convolution Conv_78 1 1 244 245 1 64 64 1 1 1 1 0 0 0 -1 1 1 ,"
"Convolution Conv_79 1 1 227 246 1 128 64 1 1 1 1 0 0 0 -1 1 1 ,"
"Concat Concat_80 2 1 245 246 247 1 ,"
"BatchNormCxx BatchNormalization_81 1 1 247 248 ,"
"PReLU LeakyRelu_82 1 1 248 249 1 0 ,"
"Convolution Conv_83 1 1 249 250 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_84 1 1 250 251 1 0 ,"
"Convolution Conv_85 1 1 251 252 1 128 256 3 3 2 2 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_86 1 1 252 253 1 0 ,"
"Convolution Conv_87 1 1 253 254 1 256 128 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_88 1 1 254 255 1 0 ,"
"Convolution Conv_89 1 1 255 256 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_90 1 1 256 257 1 0 ,"
"Convolution Conv_91 1 1 257 258 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_92 1 1 258 259 1 0 ,"
"Add Add_93 2 1 255 259 260 ,"
"Convolution Conv_94 1 1 260 261 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_95 1 1 261 262 1 0 ,"
"Convolution Conv_96 1 1 262 263 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_97 1 1 263 264 1 0 ,"
"Add Add_98 2 1 260 264 265 ,"
"Convolution Conv_99 1 1 265 266 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_100 1 1 266 267 1 0 ,"
"Convolution Conv_101 1 1 267 268 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_102 1 1 268 269 1 0 ,"
"Add Add_103 2 1 265 269 270 ,"
"Convolution Conv_104 1 1 270 271 1 128 128 1 1 1 1 0 0 0 -1 1 1 ,"
"Convolution Conv_105 1 1 253 272 1 256 128 1 1 1 1 0 0 0 -1 1 1 ,"
"Concat Concat_106 2 1 271 272 273 1 ,"
"BatchNormCxx BatchNormalization_107 1 1 273 274 ,"
"PReLU LeakyRelu_108 1 1 274 275 1 0 ,"
"Convolution Conv_109 1 1 275 276 1 256 256 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_110 1 1 276 277 1 0 ,"
"Convolution Conv_111 1 1 277 278 1 256 512 3 3 2 2 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_112 1 1 278 279 1 0 ,"
"Convolution Conv_113 1 1 279 280 1 512 256 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_114 1 1 280 281 1 0 ,"
"Pooling MaxPool_115 1 1 281 282 0 5 5 1 1 2 2 -1 -1 -1 0 ,"
"Pooling MaxPool_116 1 1 281 283 0 9 9 1 1 4 4 -1 -1 -1 0 ,"
"Pooling MaxPool_117 1 1 281 284 0 13 13 1 1 6 6 -1 -1 -1 0 ,"
"Concat Concat_118 4 1 281 282 283 284 285 1 ,"
"Convolution Conv_119 1 1 285 286 1 1024 512 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_120 1 1 286 287 1 0 ,"
"Convolution Conv_121 1 1 287 288 1 512 256 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_122 1 1 288 289 1 0 ,"
"Convolution Conv_123 1 1 289 290 1 256 256 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_124 1 1 290 291 1 0 ,"
"Convolution Conv_125 1 1 291 292 1 256 256 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_126 1 1 292 293 1 0 ,"
"Convolution Conv_127 1 1 293 294 1 256 256 1 1 1 1 0 0 0 -1 1 1 ,"
"Convolution Conv_128 1 1 287 295 1 512 256 1 1 1 1 0 0 0 -1 1 1 ,"
"Concat Concat_129 2 1 294 295 296 1 ,"
"BatchNormCxx BatchNormalization_130 1 1 296 297 ,"
"PReLU LeakyRelu_131 1 1 297 298 1 0 ,"
"Convolution Conv_132 1 1 298 299 1 512 512 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_133 1 1 299 300 1 0 ,"
"Convolution Conv_134 1 1 300 301 1 512 256 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_135 1 1 301 302 1 0 ,"
"Upsample Resize_137 1 1 302 307 1 2 2 0 ,"
"Concat Concat_138 2 1 307 277 308 1 ,"
"Convolution Conv_139 1 1 308 309 1 512 128 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_140 1 1 309 310 1 0 ,"
"Convolution Conv_141 1 1 310 311 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_142 1 1 311 312 1 0 ,"
"Convolution Conv_143 1 1 312 313 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_144 1 1 313 314 1 0 ,"
"Convolution Conv_145 1 1 314 315 1 128 128 1 1 1 1 0 0 0 -1 1 1 ,"
"Convolution Conv_146 1 1 308 316 1 512 128 1 1 1 1 0 0 0 -1 1 1 ,"
"Concat Concat_147 2 1 315 316 317 1 ,"
"BatchNormCxx BatchNormalization_148 1 1 317 318 ,"
"PReLU LeakyRelu_149 1 1 318 319 1 0 ,"
"Convolution Conv_150 1 1 319 320 1 256 256 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_151 1 1 320 321 1 0 ,"
"Convolution Conv_152 1 1 321 322 1 256 128 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_153 1 1 322 323 1 0 ,"
"Upsample Resize_155 1 1 323 328 1 2 2 0 ,"
"Concat Concat_156 2 1 328 251 329 1 ,"
"Convolution Conv_157 1 1 329 330 1 256 64 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_158 1 1 330 331 1 0 ,"
"Convolution Conv_159 1 1 331 332 1 64 64 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_160 1 1 332 333 1 0 ,"
"Convolution Conv_161 1 1 333 334 1 64 64 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_162 1 1 334 335 1 0 ,"
"Convolution Conv_163 1 1 335 336 1 64 64 1 1 1 1 0 0 0 -1 1 1 ,"
"Convolution Conv_164 1 1 329 337 1 256 64 1 1 1 1 0 0 0 -1 1 1 ,"
"Concat Concat_165 2 1 336 337 338 1 ,"
"BatchNormCxx BatchNormalization_166 1 1 338 339 ,"
"PReLU LeakyRelu_167 1 1 339 340 1 0 ,"
"Convolution Conv_168 1 1 340 341 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_169 1 1 341 342 1 0 ,"
"Convolution Conv_170 1 1 342 343 1 128 255 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_171 1 1 342 344 1 128 128 3 3 2 2 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_172 1 1 344 345 1 0 ,"
"Concat Concat_173 2 1 345 323 346 1 ,"
"Convolution Conv_174 1 1 346 347 1 256 128 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_175 1 1 347 348 1 0 ,"
"Convolution Conv_176 1 1 348 349 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_177 1 1 349 350 1 0 ,"
"Convolution Conv_178 1 1 350 351 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_179 1 1 351 352 1 0 ,"
"Convolution Conv_180 1 1 352 353 1 128 128 1 1 1 1 0 0 0 -1 1 1 ,"
"Convolution Conv_181 1 1 346 354 1 256 128 1 1 1 1 0 0 0 -1 1 1 ,"
"Concat Concat_182 2 1 353 354 355 1 ,"
"BatchNormCxx BatchNormalization_183 1 1 355 356 ,"
"PReLU LeakyRelu_184 1 1 356 357 1 0 ,"
"Convolution Conv_185 1 1 357 358 1 256 256 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_186 1 1 358 359 1 0 ,"
"Convolution Conv_187 1 1 359 360 1 256 255 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_188 1 1 359 361 1 256 256 3 3 2 2 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_189 1 1 361 362 1 0 ,"
"Concat Concat_190 2 1 362 302 363 1 ,"
"Convolution Conv_191 1 1 363 364 1 512 256 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_192 1 1 364 365 1 0 ,"
"Convolution Conv_193 1 1 365 366 1 256 256 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_194 1 1 366 367 1 0 ,"
"Convolution Conv_195 1 1 367 368 1 256 256 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU LeakyRelu_196 1 1 368 369 1 0 ,"
"Convolution Conv_197 1 1 369 370 1 256 256 1 1 1 1 0 0 0 -1 1 1 ,"
"Convolution Conv_198 1 1 363 371 1 512 256 1 1 1 1 0 0 0 -1 1 1 ,"
"Concat Concat_199 2 1 370 371 372 1 ,"
"BatchNormCxx BatchNormalization_200 1 1 372 373 ,"
"PReLU LeakyRelu_201 1 1 373 374 1 0 ,"
"Convolution Conv_202 1 1 374 375 1 512 512 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU LeakyRelu_203 1 1 375 376 1 0 ,"
"Convolution Conv_204 1 1 376 377 1 512 255 1 1 1 1 0 0 1 -1 1 1 ,"
"Sigmoid Sigmoid_214 1 1 377 387 ,"
"Reshape Reshape_219 1 1 387 394 0 4 4 0 255 14 20 ,"
"Permute Transpose_220 1 1 394 output 4 0 2 3 1 ,"
"Sigmoid Sigmoid_230 1 1 360 405 ,"
"Reshape Reshape_235 1 1 405 412 0 4 4 0 255 28 40 ,"
"Permute Transpose_236 1 1 412 413 4 0 2 3 1 ,"
"Sigmoid Sigmoid_246 1 1 343 423 ,"
"Reshape Reshape_251 1 1 423 430 0 4 4 0 255 56 80 ,"
"Permute Transpose_252 1 1 430 431 4 0 2 3 1 ,"
